{
  "title": "Tidsplan",
  "steps": [
    {
      "title": "Forberedende arbejde",
      "description": "Før nogen udvikling kan begynde, skal en række forberedende opgaver udføres: undersøgelser af problemfeltet, interviews med arkitekter, ingeniører og bygherrer, samt grundig planlægning. Det inkluderer også stiftelse og finansiering. Denne fase er allerede i gang og udmønter sig i dokumenter som finansplaner, SWOT-analyser og et udkast til vedtægter. Arbejdet udføres i øjeblikket af initiativtageren Leo Wattenberg."
    },
    {
      "title": "Hurtige skitser og plantegninger",
      "description": "Muligheden for hurtigt at generere skitser og plantegninger er kernen. Tegningerne skal være hurtige og nemme at lave, med intelligent layout, så output er klart til brug af bygherrer uden videre tilpasning. Output bør også være interoperabelt med eksisterende software. Denne fase kræver typisk to personer."
    },
    {
      "title": "Skitse til 3D-geometri",
      "description": "Skitser indeholder alle de mål, der er nødvendige for at konstruere et 3D-miljø. Denne proces bør ske automatisk (fx i baggrunden) for hurtigt at tjekke overensstemmelse med tredimensionel realitet og opdage umuligheder. Dette arbejde kræver et fuldt team: produktansvarlig, designer, 3 udviklere og QA."
    },
    {
      "title": "Geometri til visualiseringer",
      "description": "Når 3D-geometrien er til stede, kan Blender håndtere materialer, lys, animation og rendering. Blender har gjort store fremskridt og kan levere fotorealistiske resultater. Cadalus vil tilbyde integration med Blender for at skabe visualiseringer af høj kvalitet. Arbejdet her fokuserer på CAD-workflows og levering af meningsfulde baseassets."
    },
    {
      "title": "Et fuldt BIM-system",
      "description": "At gå fra CAD til BIM er en længere proces, men handler i sidste ende om datainput og funktioner, der udfører beregninger på baggrund af disse data. Hvilke funktioner der prioriteres, vil afgøres af AEC-fællesskabet. Teamstørrelsen vokser i takt med behovene, men kan forblive forholdsvis lean."
    },
    {
      "title": "Løbende udvikling",
      "description": "Når de indledende faser er gennemført, går projektet ind i en fasen med vedligeholdelse: understøttelse af flere brugstilfælde, fejlrettelser, kompatibilitet og sikring af, at softwaren forbliver brugbar for AEC-fællesskabet."
    }
  ]
}
